# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 2             ##  2--7 (6)
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 3
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 4
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 5
   [[-1, -2, -3, -4], 1, Concat, [1]], # 6
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 7

   [-1, 1, MP, []],  # 8-P3/8                                             ##  8---14(7)
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],   # 9
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],   # 10
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],   #  11
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],   # 12
   [[-1, -2, -3, -4], 1, Concat, [1]],   # 13
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 14

   [-1, 1, MP, []],  # 15-P4/16                                           ##  15---21(7)
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 16
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 17
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 18
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 19
   [[-1, -2, -3, -4], 1, Concat, [1]],   # 20
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 21

   [-1, 1, MP, []],  # 22-P5/32                                          ##  22---28(7)
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 23
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 24
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 25
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 26
   [[-1, -2, -3, -4], 1, Concat, [1]],  # 27
   [-1, 1, ODConv, [256, 1, 1]],  # 28
  ]


# yolov7-tiny head
head:
  [[-1, 1, GMConv, [256, 1, 1]],  # 29    ###  29----37
   [-2, 1, GMConv, [256, 1, 1]],  # 30
   [-1, 1, SP, [5]],  # 31
   [-2, 1, SP, [9]],  # 32
   [-3, 1, SP, [13]],  # 33
   [[-1, -2, -3, -4], 1, Concat, [1]],  # 34
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 35
   [[-1, -7], 1, Concat, [1]], # 36
   [-1, 1, GMConv, [256, 1, 1]],  # 37

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 38   ### 38--41
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 39
   [21, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P4  # 40
   [[-1, -2], 1, Concat, [1]],  # 41

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 42
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 43
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 44
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 45
   [[-1, -2, -3, -4], 1, Concat, [1]],  # 46
   [-1, 1, GMConv, [128, 1, 1]],  # 47

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 48  ### 48---51
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 49
   [14, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3  # 50
   [[-1, -2], 1, Concat, [1]],  # 51

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 52  ## 52----57
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 53
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 54
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 55
   [[-1, -2, -3, -4], 1, Concat, [1]],  # 56
   [-1, 1, GMConv, [64, 1, 1]],  # 57

   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 58  ##  58---59
   [[-1, 47], 1, Concat, [1]],  # 59

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 60  ## 60---65
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 61
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 62
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 63
   [[-1, -2, -3, -4], 1, Concat, [1]],  # 64
   [-1, 1, GMConv, [128, 1, 1]],  # 65

   [-1, 1, Conv, [256, 3, 2, None, 1, nn.LeakyReLU(0.1)]], # 66  ## 66---67
   [[-1, 37], 1, Concat, [1]],  # 67

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 68  ## 68----73
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 69
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 70
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],  # 71
   [[-1, -2, -3, -4], 1, Concat, [1]],  # 72
   [-1, 1, GMConv, [256, 1, 1]],  # 73

   [57, 1, GMConv, [128, 3, 1]],  # 74 ## 74---77
   [65, 1, GMConv, [256, 3, 1]],  # 75
   [73, 1, GMConv, [512, 3, 1]],  # 76

   [[74,75,76], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]



